glcloud/keil_v5/ARM/PACK/.Web/NXP.MKE15Z7_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>MKE15Z7_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MKE15Z7</description>
  <url>http://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="11.0.1">Removed invalid entries from Software Content Register</release>
    <release version="11.0.0">NXP CMSIS packs based on MCUXpresso SDK 2.5.0</release>
    <release version="10.0.3">A problem with missing components from some example the projects were dependent on was fixed (KEX-4241); Incorrect path to linked libraries were fixed: a pack version was a static part of the path and hadn’t worked for pack versions other than v10.0.0 (KEX-4373); A problem with incorrectly defined XIP_BOOT_HEADER_ENABLE, XIP_BOOT_HEADER_DCD_ENABLE and XIP_EXTERNAL_FLASH preprocessor symbols was fixed (KEX-4553); Missing flash algorithms for MK27, MK28, LPC802 and LPC804 device family packs were added (KEX-4659).</release>
    <release version="10.0.2">NXP CMSIS packs based on MCUXpresso SDK 2.4.0</release>
    <release version="10.0.1">NXP CMSIS packs based on MCUXpresso SDK 2.3.1</release>
    <release version="10.0.0">NXP CMSIS packs with updated Clear BSD license, based on MCUXpresso SDK 2.3.0. NXP CMSIS pack will maintain independent versioning starting with 10.0.0</release>
    <release version="2.3.0">NXP MCUXpresso SDK 2.3.0 CMSIS packs with updated Clear BSD license</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <taxonomy>
    <description Cclass="Device" Cgroup="SDK Project Template">NXP MCUXpresso SDK RTE Device Project Template</description>
    <description Cclass="Device" Cgroup="SDK Drivers">NXP MCUXpresso SDK Peripheral Drivers</description>
    <description Cclass="Device" Cgroup="SDK Utilities">NXP MCUXpresso SDK Utilities</description>
    <description Cclass="CMSIS Driver">NXP MCUXpresso SDK Peripheral CMSIS Drivers</description>
    <description Cclass="Board Support" Cgroup="SDK Project Template">NXP MCUXpresso SDK Project Template</description>
    <description Cclass="Device" Cgroup="Startup">NXP MCUXpresso SDK Start up</description>
  </taxonomy>
  <devices>
    <family Dfamily="MKE15Z7" Dvendor="NXP:11">
      <description>KE1xZ MCUs are based on the ARM Cortex-M0+ core, running up to 72 MHz. These MCUs support up to 256 KB flash, 32 KB RAM, and a complete set of analog/digital features. The robust TSI module provides a high level of stability and accuracy to any HMI system. The 1-Msps ADC and FlexTimer modules provides a perfect solution for BLDC motor-control systems.</description>
      <device Dname="MKE15Z256xxx7">
        <processor Dcore="Cortex-M0+" Dfpu="NO_FPU" Dendian="Little-endian" Dclock="72000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MKE15Z256xxx7_flash.icf"/>
        </environment>
        <memory name="FLEX_NVM" start="0x10000000" size="0x8000" access="rx"/>
        <memory name="FLEX_RAM" start="0x14000000" size="0x0800" access="rw"/>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x040000" access="rx" default="1" startup="1"/>
        <memory name="SRAM" start="0x1fffe000" size="0x8000" access="rw" default="1"/>
        <algorithm name="arm/MKE1x_P256_2KB_SEC.FLM" start="0x00000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
        <algorithm name="arm/MKE1x_D32_2KB_SEC.FLM" start="0x10000000" size="0x00008000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
        <debug svd="MKE15Z7.xml"/>
        <variant Dvariant="MKE15Z256VLL7">
          <compile header="fsl_device_registers.h" define="CPU_MKE15Z256VLL7"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKE15Z256VLL7/MKE15Z256xxx7_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKE15Z256VLH7">
          <compile header="fsl_device_registers.h" define="CPU_MKE15Z256VLH7"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKE15Z256VLH7/MKE15Z256xxx7_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
      <device Dname="MKE15Z128xxx7">
        <processor Dcore="Cortex-M0+" Dfpu="NO_FPU" Dendian="Little-endian" Dclock="72000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MKE15Z128xxx7_flash.icf"/>
        </environment>
        <memory name="FLEX_NVM" start="0x10000000" size="0x8000" access="rx"/>
        <memory name="FLEX_RAM" start="0x14000000" size="0x0800" access="rw"/>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x020000" access="rx" default="1" startup="1"/>
        <memory name="SRAM" start="0x1ffff000" size="0x4000" access="rw" default="1"/>
        <algorithm name="arm/MKE1x_P256_2KB_SEC.FLM" start="0x00000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
        <algorithm name="arm/MKE1x_D32_2KB_SEC.FLM" start="0x10000000" size="0x00008000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
        <debug svd="MKE15Z7.xml"/>
        <variant Dvariant="MKE15Z128VLL7">
          <compile header="fsl_device_registers.h" define="CPU_MKE15Z128VLL7"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKE15Z128VLL7/MKE15Z128xxx7_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKE15Z128VLH7">
          <compile header="fsl_device_registers.h" define="CPU_MKE15Z128VLH7"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKE15Z128VLH7/MKE15Z128xxx7_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="cond_MCUXpressoConfigTools">
      <accept Dname="MKE15Z256???7" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z128???7" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
